IDEA StatiCa Open Model
Hanging.PositionOnEdge Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 Position on edge
 Namespace: IdeaRS.OpenModel.Detail
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public double PositionOnEdge { get; set; }
Public Property PositionOnEdge As Double
	Get
	Set
public:
property double PositionOnEdge {
	double get ();
	void set (double value);
}
Property Value
Type: Double
See Also
Reference
Hanging Class
IdeaRS.OpenModel.Detail Namespace